SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-60151

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( DR_BR_A1_60151.s )
Size ( 2.69138m 3.97927m 14.082058m )
Mass ( 104.1t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 30cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
Comment ( * Locomotive is steam braked * )
BrakeEquipmentType( "Vacuum_brake, Auxilary_reservoir" )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 285kN ) Comment ( * braked approx 70% of mass on driving wheels, or 55% of Weight in Working Order, coefficient of friction 0.5 * )

MaxReleaseRate ( 10inHg/s ) 
MaxApplicationRate ( 1.3inHg/s )

ORTSBrakeCylinderSize ( 6in ) Comment ( Locomotive has steam brake  )
ORTSAuxilaryResCapacity ( 0.90ft^3 ) Comment ( Vacuum reservoir used for control of steam brake )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.84m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 7177 )
ORTSDavis_B ( 34.8 )
ORTSDavis_C ( 5.449 )

ORTSWagonFrontalArea (102)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 2

   	Light	(
			comment( Front Position B )
			Type ( 0 )
			Conditions (
			Headlight(4)Unit(2)
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( 1.0 1.62 6.525 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Front Position D )
			Type ( 0 )
			Conditions (
			Headlight(4)Unit(2)
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( -1.0 1.62 6.525 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.5 )
					)
				)
			)
		)
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( DR_BR_A1_60151.s )
        PassengerCabinHeadPos ( 1.423 3.0 -5.25 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ("..\\..\\Common.Steam\\A1Sound\\A1eng.sms" )
)

Engine ( OR-60151

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0.80 3.7 -5
				0 0.8 0
				0.15
			)

			SafetyValvesFX
			(
				0 4.2 -4.808
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 4.2 -4.508
				0 1 0
				0.2
			)
			StackFX
			(
				0 4.2 4.747
				0 1.95 0
				0.3
			)
			StackFX
			(
				0 4.2 4.747
				0 1.95 0
				0.25
			)
			StackFX
			(
				0 4.2 4.747
				0 1.95 0
				0.25
			)
			Injectors2FX
			(
				-1.1 0.9 -5.9
				0 -1 0
				0.16
			)
			Injectors1FX
			(
				1.1 0.9 -5.9
				0 -1 0
				0.16
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-0.987 0.47 5.115
				0 0 1
				0.15
			)

			CylindersFX
			(
				0.987 0.47 5.115
				0 0 1
				0.15
			)
		)
	)

Wagon ( OR-60151 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 40in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 66t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 325ft^3 )  
ORTSEvaporationArea ( 2461.37ft^2 )
ORTSSuperheatArea ( 679.67ft^2 )
MaxBoilerPressure ( 250psi )
MaxSteamHeatingPressure ( 80psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 19in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 50ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 9t-uk )
MaxTenderWaterMass ( 50000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

Comment(ORTSMaxIndicatedHorsepower 2293hp calculated by OR )

ORTSMaxSuperheatTemperature ( 325.0 )

ORTSBoilerEfficiency( 0.0 0.97  102.0 0.61 )Comment(Report Gr 16)comment(0 0.97 140.0 0.485)

ORTSBurnRate( 0.0 10.0   12000.0 1000.0   21000.0 2000.0   27000.0 3000.0   36000.0 4000.0   37000.0 5000.0   37500.0 6000.0  )

    
Comment ( *******************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
BrakesEngineBrakeType ( "Steam_brake" )Comment(steam_brake crahes OR in Brake HUD)
TrainPipeLeakRate ( 0.05inHg/s )


Comment ( *** Ejectors *** )
Comment (  Estimate for Gresham & Craven SJ type P ejector  )
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.34inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 210lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 110psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( == Independent Brake valve - Engine & Tender == )
EngineBrakesControllerMaxReleaseRate ( 2.0inHg/s )
EngineBrakesControllerMaxApplicationRate ( 2.0inHg/s )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Comment ( Locomotive brake based upon Gresham & Craven MkIV Steam Brake Valve )
Brake_Engine ( 0 1 0.25 0.0
NumNotches( 5
Notch( 0.00 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.25 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.50 0 EngineBrakesControllerBrakeNotchStart )
Notch( 0.75 0 EngineBrakesControllerBrakeNotchStart )
Notch( 1.00 0 EngineBrakesControllerBrakeNotchStart ) ) )


Comment ( Based upon Gresham & Craven SJ Ejector and control valve )
Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


ORTSSmallEjector ( 0 1 0.1 1.0 NumNotches ( 0 ) )

Brake_Brakeman ( 0 1 0.2 0.3
NumNotches ( 1
Notch( 0 1 BrakemanBrakesControllerManualBrakingStart ) ) )

            FireDoor ( 0 1 0.075 1 
                NumNotches( 0 ))
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 ))
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 1 0 
                NumNotches( 6 
				Notch ( 0     	0 Dummy )
				Notch ( 0.25	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )
                   	Notch ( 2   	0 Dummy )
				)
            )
            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 6 
                		Notch ( 0     	0 Dummy )
                   	Notch ( 0.15   	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
				Notch ( 1		0 Dummy )
			)
		)
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 5 
				Notch ( 0     	0 Dummy )
                   	Notch ( 0.25   	0 Dummy )
                   	Notch ( 0.5   	0 Dummy )
                   	Notch ( 0.75   	0 Dummy )
                   	Notch ( 1   	0 Dummy )

			)
		)
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            Headlights( 0 1 0 )
        )

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( TornadoA1P.cvf )
HeadOut (  -1.423 3.0 -5.25 )
Sound ("..\\..\\Common.Steam\\A1Sound\\A1cab.sms" )
Name ( "60151 A1 Peppercorn, MIDLOTHIAN, York Shed 50A, TE 37.4Klbf - Coal 9t, Water 5000gal" )
Description (
"The first A1, No. 60114, entered traffic in August 1948. A total of 49 were built in four batches between 1948 and 1949. Early on, there were often problems with live steam reaching the cab and causing significant discomfort for the enginemen. It took a few years to track down the various sources, but these were fixed. 
The A1s were quickly built, and were quickly accepted by staff who had been suffering shortages of locomotives and repair materials since World War II. They started work with heavy express passenger trains."
)
)